In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c': 30}

In [3]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(data=arr, index=labels)

a    10
b    20
c    30
dtype: int32

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])

In [8]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [9]:
ser2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])

In [10]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [11]:
ser3 = pd.Series(data=labels)

In [12]:
ser3

0    a
1    b
2    c
dtype: object

In [13]:
ser3[1]

'b'

In [14]:
ser2['USA']

1

In [15]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

### DATAFRAMES

In [16]:
from numpy.random import randn

In [17]:
np.random.seed(101)

In [18]:
df = pd.DataFrame(data=randn(5, 4), index=['A', 'B', 'C', 'D', 'E'], columns=['W', 'X', 'Y', 'Z'])

In [19]:
randn(5, 4)

array([[ 0.30266545,  1.69372293, -1.70608593, -1.15911942],
       [-0.13484072,  0.39052784,  0.16690464,  0.18450186],
       [ 0.80770591,  0.07295968,  0.63878701,  0.3296463 ],
       [-0.49710402, -0.7540697 , -0.9434064 ,  0.48475165],
       [-0.11677332,  1.9017548 ,  0.23812696,  1.99665229]])

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
len(df)

5

In [22]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [23]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [24]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [25]:
len(df)

5

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df['new'] = df['X'] + df['Y']

In [28]:
df['new1'] = df['X'] + df['Y'] + df['Z']

In [29]:
df

          W         X         Y         Z       new      new1
A  2.706850  0.628133  0.907969  0.503826  1.536102  2.039928
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395 -0.561430
C -2.018168  0.740122  0.528813 -0.589001  1.268936  0.679935
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109 -0.737053
E  0.190794  1.978757  2.605967  0.683509  4.584725  5.268233

In [30]:
len(df)

5

In [31]:
df.drop('new', axis=1) # Doesn't happen inplace

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  2.039928
B  0.651118 -0.319318 -0.848077  0.605965 -0.561430
C -2.018168  0.740122  0.528813 -0.589001  0.679935
D  0.188695 -0.758872 -0.933237  0.955057 -0.737053
E  0.190794  1.978757  2.605967  0.683509  5.268233

In [32]:
df

          W         X         Y         Z       new      new1
A  2.706850  0.628133  0.907969  0.503826  1.536102  2.039928
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395 -0.561430
C -2.018168  0.740122  0.528813 -0.589001  1.268936  0.679935
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109 -0.737053
E  0.190794  1.978757  2.605967  0.683509  4.584725  5.268233

In [33]:
len(df)

5

In [34]:
df.drop('new', axis=1, inplace=True)

In [35]:
df

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  2.039928
B  0.651118 -0.319318 -0.848077  0.605965 -0.561430
C -2.018168  0.740122  0.528813 -0.589001  0.679935
D  0.188695 -0.758872 -0.933237  0.955057 -0.737053
E  0.190794  1.978757  2.605967  0.683509  5.268233

In [36]:
df.iloc[:, [1, 2, 3]]

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [37]:
df.iloc[-1, 2]

2.60596727979128

In [38]:
df.drop('E')

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  2.039928
B  0.651118 -0.319318 -0.848077  0.605965 -0.561430
C -2.018168  0.740122  0.528813 -0.589001  0.679935
D  0.188695 -0.758872 -0.933237  0.955057 -0.737053

In [39]:
# SELECTING ROWS
# TO get rows as series
df.loc['A']

W       2.706850
X       0.628133
Y       0.907969
Z       0.503826
new1    2.039928
Name: A, dtype: float64

In [40]:
# Index based location
df.iloc[1]

W       0.651118
X      -0.319318
Y      -0.848077
Z       0.605965
new1   -0.561430
Name: B, dtype: float64

In [41]:
df.loc['B', 'Y']

-0.8480769834036315

In [42]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [43]:
df > 0

       W      X      Y      Z   new1
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False   True
D   True  False  False   True  False
E   True   True   True   True   True

In [44]:
booldf = df > 0

In [45]:
booldf

       W      X      Y      Z   new1
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False   True
D   True  False  False   True  False
E   True   True   True   True   True

In [46]:
df[booldf]

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  2.039928
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN  0.679935
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  5.268233

In [47]:
df[df > 0]

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  2.039928
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN  0.679935
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  5.268233

In [48]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [49]:
df[df['W'] > 0]

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  2.039928
B  0.651118 -0.319318 -0.848077  0.605965 -0.561430
D  0.188695 -0.758872 -0.933237  0.955057 -0.737053
E  0.190794  1.978757  2.605967  0.683509  5.268233

In [50]:
df[df['Z'] < 0]['X']

C    0.740122
Name: X, dtype: float64

In [51]:
df[df['W'] > 0][['X', 'Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

In [52]:
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z      new1
E  0.190794  1.978757  2.605967  0.683509  5.268233

In [53]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  2.039928
B  0.651118 -0.319318 -0.848077  0.605965 -0.561430
D  0.188695 -0.758872 -0.933237  0.955057 -0.737053
E  0.190794  1.978757  2.605967  0.683509  5.268233

In [54]:
df.reset_index()

  index         W         X         Y         Z      new1
0     A  2.706850  0.628133  0.907969  0.503826  2.039928
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.561430
2     C -2.018168  0.740122  0.528813 -0.589001  0.679935
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.737053
4     E  0.190794  1.978757  2.605967  0.683509  5.268233

In [55]:
new_ind = "CA NY WY OR CO".split()

In [56]:
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [57]:
df['States'] = new_ind

In [58]:
df

          W         X         Y         Z      new1 States
A  2.706850  0.628133  0.907969  0.503826  2.039928     CA
B  0.651118 -0.319318 -0.848077  0.605965 -0.561430     NY
C -2.018168  0.740122  0.528813 -0.589001  0.679935     WY
D  0.188695 -0.758872 -0.933237  0.955057 -0.737053     OR
E  0.190794  1.978757  2.605967  0.683509  5.268233     CO

In [59]:
df.set_index('States')

               W         X         Y         Z      new1
States
CA      2.706850  0.628133  0.907969  0.503826  2.039928
NY      0.651118 -0.319318 -0.848077  0.605965 -0.561430
WY     -2.018168  0.740122  0.528813 -0.589001  0.679935
OR      0.188695 -0.758872 -0.933237  0.955057 -0.737053
CO      0.190794  1.978757  2.605967  0.683509  5.268233

In [60]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
print(hier_index)
hier_index = pd.MultiIndex.from_tuples(hier_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [61]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [62]:
df = pd.DataFrame(data=randn(6, 2), index=hier_index, columns=['A', 'B'])

In [63]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [64]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [65]:
df.loc['G1'].loc[1]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [66]:
df.index.names = ['Group', 'Num']

In [67]:
df

                  A         B
Group Num
G1    1   -0.993263  0.196800
      2   -1.136645  0.000366
      3    1.025984 -0.156598
G2    1   -0.031579  0.649826
      2    2.154846 -0.610259
      3   -0.755325 -0.346419

In [68]:
df.loc['G2'].loc[2]['B']

-0.6102588558227414

In [69]:
df.loc['G2'].loc[2]

A    2.154846
B   -0.610259
Name: 2, dtype: float64

In [70]:
df

                  A         B
Group Num
G1    1   -0.993263  0.196800
      2   -1.136645  0.000366
      3    1.025984 -0.156598
G2    1   -0.031579  0.649826
      2    2.154846 -0.610259
      3   -0.755325 -0.346419

In [71]:
df.xs('G1')

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

In [72]:
df.xs(1, level='Num')

              A         B
Group
G1    -0.993263  0.196800
G2    -0.031579  0.649826

### PANDAS - MISSING DATA

In [73]:
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}

In [74]:
df = pd.DataFrame(d)

In [75]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [76]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [77]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [78]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [79]:
df.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [80]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [81]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### PANDAS - GROUPBY

In [82]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [83]:
df = pd.DataFrame(data)

In [84]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [ ]:
by_comp = df.groupby('Company')

In [147]:
by_comp.head()

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [86]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [87]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [88]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [89]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [90]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [91]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [92]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [93]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [94]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

### Pandas - Merging, Joining, and Concatenating

In [95]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [96]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [97]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [98]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [99]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [100]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [101]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [102]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [103]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [104]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [105]:
pd.concat([left, right], axis=1)

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3

In [106]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [107]:
pd.merge(left, right, how='outer', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [108]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [109]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

### Pandas - Joining

In [110]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [111]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [112]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [113]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [114]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Pandas - Operations

In [115]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [116]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [117]:
df['col2'].unique() # Returns a NumPy array of unique values.

array([444, 555, 666], dtype=int64)

In [118]:
df['col2'].nunique()

3

In [119]:
# to get how many times each unique value occured in column
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [120]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [121]:
def times2(x):
    return x * 2

In [122]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [123]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [124]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [125]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [126]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [127]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [128]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [129]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [130]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [131]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [132]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [133]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Data Input and Output

In [134]:
pwd

'D:\\Workspace\\Python\\python_for_ds\\Pandas'

In [135]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [136]:
df = pd.read_csv('example.csv')

In [137]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [138]:
df.to_csv('test_output.csv', index=False)

In [139]:
pd.read_csv('test_output.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [140]:
df = pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

In [141]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [142]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet', index=False)

In [143]:
pd.read_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [144]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

ValueError: No tables found

In [ ]:
from sqlalchemy import create_engine

In [ ]:
engine = create_engine('sqlite:///:memory:')

In [ ]:
df

In [ ]:
df.to_sql('my_table', engine)

In [ ]:
sqldf = pd.read_sql('my_table', con=engine)

In [ ]:
sqldf

In [ ]:
from datetime import datetime, timedelta

In [ ]:
(datetime.now() - timedelta(days=1)).strftime('%Y-%m-%d')

In [ ]:
pd.Series([1, 2, 3])

In [ ]:
df = pd.DataFrame(data=[[1,2]], columns=['x', 'y'])

In [ ]:
df

In [ ]:
df['x'] == 1

In [ ]:
if df['y'].tolist()[0] == 2:
    print("hello")

In [152]:
df['y'].tolist()

KeyError: 'y'

In [161]:
def get_unique_dates_and_times(df):
    dates = []
    times = []
    for j in range(len(df)):
        dates.append(df.iloc[j, 0].split(' ')[0])
        times.append(df.iloc[j, 0].split(' ')[1])
    df['date'] = pd.Series(dates)
    df['time'] = pd.Series(times)
    # print("dates: ", dates)
    unique_dates = []
    for date in dates:
        if date not in unique_dates:
            unique_dates.append(date)
    # print(unique_dates)
    # print("comp_data: ", df)
    return df, unique_dates, None

In [162]:
def vwap(df):
    q = df.volume.values
    p = df.close.values
    return df.assign(vwap=(p * q).cumsum() / q.cumsum())

In [163]:
df = pd.read_csv('ADANIPORTS_previous_stock_data.csv')

In [164]:
df

                     timestamp    open    high     low   close   volume  test
0    2021-04-12 09:15:00+05:30  809.90  809.90  784.50  784.95  1386924     0
1    2021-04-12 09:20:00+05:30  784.00  785.00  770.00  770.35  1330412     0
2    2021-04-12 09:25:00+05:30  770.80  781.75  770.35  777.10   828104     0
3    2021-04-12 09:30:00+05:30  776.50  778.55  772.00  775.45   568793     0
4    2021-04-12 09:35:00+05:30  774.35  781.75  773.25  780.85   609077     0
..                         ...     ...     ...     ...     ...      ...   ...
233  2021-04-16 09:55:00+05:30  764.20  771.60  764.05  771.20  1261070     0
234  2021-04-16 10:00:00+05:30  770.70  774.95  765.40  765.70  1333414     0
235  2021-04-16 10:05:00+05:30  766.00  774.30  765.65  772.95   887373     0
236  2021-04-16 10:10:00+05:30  772.95  781.30  770.35  781.10  1783552     0
237  2021-04-16 10:15:00+05:30  780.80  782.40  779.35  781.55   693623     0

[238 rows x 7 columns]

In [166]:
df, dates, times = get_unique_dates_and_times(df)

In [167]:
df

,timestamp,open,high,low,close,volume,test,date,time
0,2021-04-12 09:15:00+05:30,809.90,809.90,784.50,784.95,1386924,0,2021-04-12,09:15:00+05:30
1,2021-04-12 09:20:00+05:30,784.00,785.00,770.00,770.35,1330412,0,2021-04-12,09:20:00+05:30
2,2021-04-12 09:25:00+05:30,770.80,781.75,770.35,777.10,828104,0,2021-04-12,09:25:00+05:30
3,2021-04-12 09:30:00+05:30,776.50,778.55,772.00,775.45,568793,0,2021-04-12,09:30:00+05:30
4,2021-04-12 09:35:00+05:30,774.35,781.75,773.25,780.85,609077,0,2021-04-12,09:35:00+05:30
...,...,...,...,...,...,...,...,...,...
233,2021-04-16 09:55:00+05:30,764.20,771.60,764.05,771.20,1261070,0,2021-04-16,09:55:00+05:30
234,2021-04-16 10:00:00+05:30,770.70,774.95,765.40,765.70,1333414,0,2021-04-16,10:00:00+05:30
235,2021-04-16 10:05:00+05:30,766.00,774.30,765.65,772.95,887373,0,2021-04-16,10:05:00+05:30
236,2021-04-16 10:10:00+05:30,772.95,781.30,770.35,781.10,1783552,0,2021-04-16,10:10:00+05:30
237,2021-04-16 10:15:00+05:30,780.80,782.40,779.35,781.55,693623,0,2021-04-16,10:15:00+05:30

In [173]:
df = df.groupby('date').apply(vwap)

In [174]:
df

                                timestamp    open    high     low   close  \
date
2021-04-12 0    2021-04-12 09:15:00+05:30  809.90  809.90  784.50  784.95
           1    2021-04-12 09:20:00+05:30  784.00  785.00  770.00  770.35
           2    2021-04-12 09:25:00+05:30  770.80  781.75  770.35  777.10
           3    2021-04-12 09:30:00+05:30  776.50  778.55  772.00  775.45
           4    2021-04-12 09:35:00+05:30  774.35  781.75  773.25  780.85
...                                   ...     ...     ...     ...     ...
2021-04-16 233  2021-04-16 09:55:00+05:30  764.20  771.60  764.05  771.20
           234  2021-04-16 10:00:00+05:30  770.70  774.95  765.40  765.70
           235  2021-04-16 10:05:00+05:30  766.00  774.30  765.65  772.95
           236  2021-04-16 10:10:00+05:30  772.95  781.30  770.35  781.10
           237  2021-04-16 10:15:00+05:30  780.80  782.40  779.35  781.55

                 volume  test        date            time        vwap
date
2021-04-12 0    1386924     0  2021-04-12  09:15:00+05:30  784.950000
           1    1330412     0  2021-04-12  09:20:00+05:30  777.801817
           2     828104     0  2021-04-12  09:25:00+05:30  777.637894
           3     568793     0  2021-04-12  09:30:00+05:30  777.335418
           4     609077     0  2021-04-12  09:35:00+05:30  777.788628
...                 ...   ...         ...             ...         ...
2021-04-16 233  1261070     0  2021-04-16  09:55:00+05:30  758.238994
           234  1333414     0  2021-04-16  10:00:00+05:30  759.460873
           235   887373     0  2021-04-16  10:05:00+05:30  760.786526
           236  1783552     0  2021-04-16  10:10:00+05:30  764.137142
           237   693623     0  2021-04-16  10:15:00+05:30  765.186796

[238 rows x 10 columns]

In [175]:
df.iloc[-1, :][-1]

765.1867962073602

In [177]:
df.to_csv("new/hello.csv")